// 조건문 if문
/* 1) 사용법 : 조건식이 참(true)이면 명령문이 실행됨
    if (조건식) {
        명령문(실행);
    }


*/
// 예제) 19살 이상이면 성인입니다. 를 출력하세요

// let char = prompt("나이를 입력하세요");
// if (char >= 19) {
//   alert("성인입니다.");
// } else {
//   alert("성인이 아닙니다.");
// }

// 2) 조건문 : if/else문
/* 
    사용법 : 조건식이 참(true)이면 실행문1이 실행되고, 거짓이면 실행문2가 실행된다.
    if (조건식) {
        실행문1
    } else {
        실행문2
    }
// */
// // 예제 : 19살 이상이면 성인입니다. 를 출력하고 19살 미만이면 미성년입니다.를 출력
// let age = prompt("나이를 입력하세요");
// if (age >= 19) {
//     alert("성인입니다.")
// } else {
//     alert("미성년입니다.")
    
// }

// 3) 조건문 : if / else if/ else 문
// let age = 18;
// if (age >= 19) {
//     alert("성인입니다.")
// } else if (age == 18) {
//     alert("청소년입니다.")
// } else {
//     alert("미성년입니다.")
// }

// 4)
// let age = 19;
// while (age<30) {
//     alert("청소년 입니다");
//     age++;
//     alert("한살을 먹었습니다.");
// }


// 연습) x = 10 이고, y = 20 값이 있습니다.
// x와 y 같으면 "같다" 출력하고,
// x < y 이면 "x가 y보다 작다" 출력하고,
// x > y 이면 "x가 y보다 크다" 출력하고,

// let x = 10;
// let y = 20;
// if (x == y){
//     alert("x와 y가 같다");
// } else if (x < y){
//     alert("x가 y보다 작다");
// } else {
//     alert("x가 y보다 크다");

// }


// 연습2 ) 10보다 작은 수가 입력되면 small을 출력하고, 10 이상이면 아무것도 출력하지 마세요

// let input = Number(prompt("숫자를 입력하세요"));
// if (input < 10) {
//     alert("small");
// }
